In [130]:
# Importing essential modules
import pandas as pd
import sqlite3
from plotly import express as px
from sklearn.linear_model import LinearRegression

# Creating a database

In [50]:
# Read in the temperature df
temps = pd.read_csv("temps_stacked.csv")
# Read in the countries df
countries = pd.read_csv('countries.csv')
# Read in the stations df directly from url
url = "https://raw.githubusercontent.com/PhilChodrow/PIC16B/master/datasets/noaa-ghcn/station-metadata.csv"
stations = pd.read_csv(url)

# Substitute white space for underscore in df column names
countries = countries.rename(columns= {"FIPS 10-4": "FIPS_10_4"})
countries = countries.rename(columns= {"ISO 3166": "ISO_3166"})

In [51]:
# Create and connect to a temps.db database
conn = sqlite3.connect("temps.db")

# Add the three tables to temps.db
temps.to_sql("temperatures", conn, if_exists="replace", index=False)
stations.to_sql("stations", conn, if_exists="replace", index=False)
countries.to_sql("countries", conn, if_exists="replace", index=False)

# close your connection after database construction
conn.close()

In [36]:
temps.head(5)

            ID  Year  Month   Temp
0  ACW00011604  1961      1  -0.89
1  ACW00011604  1961      2   2.36
2  ACW00011604  1961      3   4.72
3  ACW00011604  1961      4   7.73
4  ACW00011604  1961      5  11.28

In [52]:
countries.head(5)

  FIPS_10_4 ISO_3166            Name
0        AF       AF     Afghanistan
1        AX        -        Akrotiri
2        AL       AL         Albania
3        AG       DZ         Algeria
4        AQ       AS  American Samoa

In [38]:
stations.head(5)

            ID  LATITUDE  LONGITUDE  STNELEV                  NAME
0  ACW00011604   57.7667    11.8667     18.0                  SAVE
1  AE000041196   25.3330    55.5170     34.0    SHARJAH_INTER_AIRP
2  AEM00041184   25.6170    55.9330     31.0   RAS_AL_KHAIMAH_INTE
3  AEM00041194   25.2550    55.3640     10.4            DUBAI_INTL
4  AEM00041216   24.4300    54.4700      3.0  ABU_DHABI_BATEEN_AIR

# Query Function

In [90]:
def query_climate_database(country, year_begin, year_end, month):
    # Connect to the database
    conn = sqlite3.connect("temps.db")
    # SQL command for joining the tables and returning the desired columns
    cmd = '''
    SELECT
        s.NAME, s.LATITUDE, s.LONGITUDE, c.Name Country, t.Year, t.Month, t.Temp
    FROM
        temperatures t
    LEFT JOIN stations s ON t.ID = s.ID
    LEFT JOIN countries c ON SUBSTR(t.ID, 1, 2) = c.FIPS_10_4
    '''
    # Execute the SQL command and store the queried data into df
    df = pd.read_sql_query(cmd, conn)
    conn.close()
    # Return entries that follow user specifications
    return df.loc[(df.Country == country) & (df.Month == month) &
                  (df.Year >= year_begin) & (df.Year <= year_end)].reset_index().drop('index', axis = 1)

In [91]:
df = query_climate_database(country = "India", 
                       year_begin = 1980, 
                       year_end = 2020,
                       month = 1)

In [103]:
df

               NAME  LATITUDE  LONGITUDE Country  Year  Month   Temp
0     PBO_ANANTAPUR    14.583     77.633   India  1980      1  23.48
1     PBO_ANANTAPUR    14.583     77.633   India  1981      1  24.57
2     PBO_ANANTAPUR    14.583     77.633   India  1982      1  24.19
3     PBO_ANANTAPUR    14.583     77.633   India  1983      1  23.51
4     PBO_ANANTAPUR    14.583     77.633   India  1984      1  24.81
...             ...       ...        ...     ...   ...    ...    ...
3147     DARJEELING    27.050     88.270   India  1983      1   5.10
3148     DARJEELING    27.050     88.270   India  1986      1   6.90
3149     DARJEELING    27.050     88.270   India  1994      1   8.10
3150     DARJEELING    27.050     88.270   India  1995      1   5.60
3151     DARJEELING    27.050     88.270   India  1997      1   5.70

[3152 rows x 7 columns]

# Geographic Scatter Function for Yearly Temperature Increases

In [131]:
# Function that takes in a data frame (with Year and Temp columns)
# Regresses on the data points and returns the best fit line's slope
def coef(data_group):
    X = data_group[["Year"]] # expect data frame, not series
    y = data_group["Temp"]
    LR = LinearRegression()
    LR.fit(X, y)
    slope = LR.coef_[0]
    return slope

In [142]:
def temperature_coefficient_plot(country, year_begin, year_end, month, min_obs, **kwargs):
    raw = query_climate_database(country = country, 
                                 year_begin = year_begin, 
                                 year_end = year_end,
                                 month = month)
    freq = pd.DataFrame(raw.groupby(['NAME', 'Month'])['Temp'].transform(len)).rename(columns={'Temp':'freq'})
    raw = raw.join(freq)
    filtered = raw[raw.freq >= min_obs]
    temp_change = filtered.groupby(["NAME", "Month"]).apply(coef)
    fig = px.scatter_mapbox(temp_change, # data for the points you want to plot
                            lat = "LATITUDE", # column name for latitude informataion
                            lon = "LONGITUDE", # column name for longitude information
                            hover_name = "NAME", # what's the bold text that appears when you hover over
                            **kwargs) # remaining user-specified arguments
    fig.update_layout(margin={"r":0,"t":0,"l":0,"b":0})
    return fig

In [ ]:
# assumes you have imported necessary packages
color_map = px.colors.diverging.RdGy_r # choose a colormap

fig = temperature_coefficient_plot("India", 1980, 2020, 1, 
                                   min_obs = 10,
                                   zoom = 2,
                                   mapbox_style="carto-positron",
                                   color_continuous_scale=color_map)

fig.show()